# Завдання 1
# Виведіть на екран вектор, який би містив всі парні елементи від 1 до 100 включно.
# Оператор, що вираховує залишок від ділення - %%
even_numbers <- 
print(even_numbers)
  
# Завдання 2
# Виведіть на екран імена всіх людей з таблиці dixi_nerds, які мають 
# світле волосся і вищі за 175 сантиметрів.
dixi_filtered <- 
  
# Завдання 3
# З даних таблички coal_reserves_station отримайте середньодобовий відсоток
# виконання плану з запасів антрацитового вугілля на станціях Рината Ахметова
akhmetov_ant <- 



